Hello Anton, thanks for the quick reply!

> terraform plan is telling just a plan but I recommend running terraform apply and see the produced results.

Yes indeed I spotted the problem by looking at the CF distribution generated by Terraform in the AWS console

> There is a special key name default in cache_behavior, and all other keys should go to ordered_cache_behavior.

Yes, that's what I'm doing

> If the problem exists please provide the result of the terraform plan command.

I assume it's easier for you if we stay on the _complete example_

**main.tf**
````
  cache_behavior = {
    default = {
      target_origin_id       = "appsync"
      viewer_protocol_policy = "allow-all"

      allowed_methods = ["GET", "HEAD", "OPTIONS"]
      cached_methods  = ["GET", "HEAD"]
      compress        = true
      query_string    = true

      lambda_function_association = {

        # Valid keys: viewer-request, origin-request, viewer-response, origin-response
        viewer-request = {
          lambda_arn   = module.lambda_function.this_lambda_function_qualified_arn
          include_body = true
        }

        origin-request = {
          lambda_arn = module.lambda_function.this_lambda_function_qualified_arn
        }
      }
    }

    s3 = {
      path_pattern           = "/static/*"
      target_origin_id       = "s3_one"
      viewer_protocol_policy = "redirect-to-https"

      allowed_methods = ["GET", "HEAD", "OPTIONS"]
      cached_methods  = ["GET", "HEAD"]
      compress        = true
      query_string    = true
    }

    another_s3 = {
      path_pattern           = "/another/*"
      target_origin_id       = "s3_one"
      viewer_protocol_policy = "redirect-to-https"

      allowed_methods = ["GET", "HEAD", "OPTIONS"]
      cached_methods  = ["GET", "HEAD"]
      compress        = true
      query_string    = true
    }
  }
````

**terraform apply output**

````
# module.cloudfront.aws_cloudfront_distribution.this[0] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                        = [
          + "cdn.terraform-aws-modules.modules.tf",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "My awesome CloudFront"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = false

      + default_cache_behavior {
          + allowed_methods           = (known after apply)
          + cached_methods            = (known after apply)
          + compress                  = (known after apply)
          + default_ttl               = (known after apply)
          + field_level_encryption_id = (known after apply)
          + max_ttl                   = (known after apply)
          + min_ttl                   = (known after apply)
          + smooth_streaming          = (known after apply)
          + target_origin_id          = "appsync"
          + trusted_signers           = (known after apply)
          + viewer_protocol_policy    = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = (known after apply)
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = (known after apply)
                  + whitelisted_names = (known after apply)
                }
            }

          + lambda_function_association {
              + event_type   = (known after apply)
              + include_body = (known after apply)
              + lambda_arn   = (known after apply)
            }
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = (known after apply)
          + prefix          = (known after apply)
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "/another/*"
          + target_origin_id       = "s3_one"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward = "none"
                }
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "/static/*"
          + target_origin_id       = "s3_one"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + domain_name = "appsync.terraform-aws-modules.modules.tf"
          + origin_id   = "appsync"

          + custom_header {
              + name  = "X-Forwarded-Scheme"
              + value = "https"
            }
          + custom_header {
              + name  = "X-Frame-Options"
              + value = "SAMEORIGIN"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                ]
            }
        }
      + origin {
          + domain_name = (known after apply)
          + origin_id   = (known after apply)
          + origin_path = (known after apply)

          + custom_header {
              + name  = (known after apply)
              + value = (known after apply)
            }

          + custom_origin_config {
              + http_port                = (known after apply)
              + https_port               = (known after apply)
              + origin_keepalive_timeout = (known after apply)
              + origin_protocol_policy   = (known after apply)
              + origin_read_timeout      = (known after apply)
              + origin_ssl_protocols     = (known after apply)
            }

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + origin_group {
          + origin_id = "group_one"

          + failover_criteria {
              + status_codes = [
                  + 403,
                  + 404,
                  + 500,
                  + 502,
                ]
            }

          + member {
              + origin_id = "appsync"
            }
          + member {
              + origin_id = "s3_one"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = [
                  + "GB",
                  + "NO",
                  + "UA",
                  + "US",
                ]
              + restriction_type = "whitelist"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

````

As you can see, the 2 _ordered_cache_behavior_ are not in the same order as in **main.tf**. The _static_ one should come first.
